loadtests/advance-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10

scenarios:
  - flow:
      - get:
          url: "/api/users"
      - post:
          url: "/api/users"
          json:
            user:
              name: "John Doe"
              email: "john.doe@example.com"