loadtests/dynamic-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 3
      name: "Dynamic Test"
  processor: "./helper/functions.js"

scenarios:
  - flow:
      - get:
          url: "/api/users"
      - post:
          url: "/api/users"
          json: {}
          beforeRequest:
            - "setJSONBody"